print("********************运算符********************")

print("********************算数运算符********************")
-- + - * / % ^
-- 没有自增自减 ++ --
-- 没有复合运算符 += -= /= *= %=
-- 字符串可以进行 算数运算符操作 会自动转成number

print("加法运算"..1 + 2)
a = 1
b = 2
print("加法运算"..a + b)
print("123" + 1)
print("123.4" + 1)--自动转化
-- ^ lua中此符号是幂运算符
print("幂运算"..2 ^ 5)

print("********************条件运算符********************")
-- < > <= >= == ~=

--Lua中的不等 是~= 不是!=

print("********************逻辑运算符********************")
-- && || !  C#中的逻辑与 逻辑或 取反
-- and or not Lua中的对应  "也支持逻辑运算的“短路”规则"
print(true and false)
print(true and true)

print(true or false)
print(false or false)

print(not false)

print(false and print("123")) 短路 已经满足为false条件 不执行后续代码
print(true and print("123")) 
print("********************位运算符********************")
--不支持  & | 不支持位运算符 需要自己实现

print("********************三目运算符********************")
--也不支持  ? : 
