print("********************函数********************")
--function 函数名
--end

--a = function()
--end

print("********************无参数无返回值********************")
function F1()
	print("F1函数")
end
--不能在函数声明前调用它
F1()
--有点类似 C#中的委托和事件
function F2()
	print("F2函数")
end
F2()
print("********************有参数********************")

function F3(a )
	print(a)
end
F3(1)
F3("123")
F3(true)
F3()
print("********************有返回值********************")

print("********************函数的类型********************")

print("********************函数的重载********************")

print("********************变长参数********************")

print("********************函数嵌套********************")