print("********************复杂数据类型 table********************")
--所有的复杂类型都是table（表）

print("********************数组********************")
a = {} --空表
a = {1,nil,3,4,"1231",true,nil,6,7}
print(a)
print(a[1])
print(a[5])
print(a[6])
print(a[10])
print(#a)
--#是通用的获取长度的关键字
--在打印长度的时候 空被忽略(现在版本不会)

print("********************数组的遍历********************")
for i=1,#a do
	print(a[i])
end

print("********************二维数组********************")
a = {{1,2,3},{4,5,6}}
print(a[1][1])
print(a[1][2])
print(a[1][3])
print(a[2][1])
print(a[2][2])
print(a[2][3])
print("********************二维数组的遍历********************")
for i=1,#a do
	b = a[i]
	for j=1,#b do
		print(b[j])
	end
end

print("********************自定义索引********************")
aa = {[0] = 1,2,3,[-1]=4,5}
print(aa[0])
print(aa[-1])
print(aa[1])
print(aa[2])
print(aa[3])
aa = {[1] = 1,[2] = 2,[5] = 4,[6] = 5}
print(#aa)
aa = {[1] = 1,[2] = 2,[4] = 4,[6] = 5}
for i=1,#aa do
	print(aa[i])
end