print("********************复杂数据类型 table********************")
--所有的复杂类型都是table（表）

print("********************数组********************")
a = {} --空表
a = {1,nil,3,4,"1231",true,nil,6,7}
print(a)
print(a[1])
print(a[5])
print(a[6])
print(a[10])
print(#a)
--#是通用的获取长度的关键字
--在打印长度的时候 空被忽略(现在版本不会)

print("********************数组的遍历********************")
for i=1,#a do
	print(a[i])
end

print("********************二维数组********************")

print("********************二维数组的遍历********************")

print("********************自定义索引********************")